benchmark/go-frameworks/results/20260924-102750/results/post/gin/r1/80000.txt
Running 40s test @ http://10.128.0.4:8083/api/devices
  16 threads and 512 connections
  Thread calibration: mean lat.: 44.943ms, rate sampling interval: 368ms
  Thread calibration: mean lat.: 50.480ms, rate sampling interval: 425ms
  Thread calibration: mean lat.: 45.037ms, rate sampling interval: 368ms
  Thread calibration: mean lat.: 45.695ms, rate sampling interval: 375ms
  Thread calibration: mean lat.: 40.869ms, rate sampling interval: 300ms
  Thread calibration: mean lat.: 39.163ms, rate sampling interval: 322ms
  Thread calibration: mean lat.: 40.241ms, rate sampling interval: 316ms
  Thread calibration: mean lat.: 39.462ms, rate sampling interval: 333ms
  Thread calibration: mean lat.: 38.867ms, rate sampling interval: 334ms
  Thread calibration: mean lat.: 39.102ms, rate sampling interval: 299ms
  Thread calibration: mean lat.: 40.790ms, rate sampling interval: 338ms
  Thread calibration: mean lat.: 41.532ms, rate sampling interval: 323ms
  Thread calibration: mean lat.: 36.949ms, rate sampling interval: 299ms
  Thread calibration: mean lat.: 47.159ms, rate sampling interval: 379ms
  Thread calibration: mean lat.: 42.819ms, rate sampling interval: 342ms
  Thread calibration: mean lat.: 36.408ms, rate sampling interval: 286ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     4.18ms   18.28ms 369.41ms   97.44%
    Req/Sec     4.98k   128.68     5.11k    96.34%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.34ms
 75.000%    1.96ms
 90.000%    3.50ms
 99.000%  106.82ms
 99.900%  226.18ms
 99.990%  294.65ms
 99.999%  347.39ms
100.000%  369.66ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.094     0.000000            2         1.00
       0.562     0.100000       237718         1.11
       0.782     0.200000       475092         1.25
       0.973     0.300000       712598         1.43
       1.154     0.400000       949623         1.67
       1.336     0.500000      1187380         2.00
       1.430     0.550000      1306715         2.22
       1.530     0.600000      1424469         2.50
       1.643     0.650000      1543321         2.86
       1.779     0.700000      1661970         3.33
       1.957     0.750000      1780970         4.00
       2.075     0.775000      1840715         4.44
       2.221     0.800000      1899462         5.00
       2.417     0.825000      1958920         5.71
       2.679     0.850000      2017963         6.67
       3.029     0.875000      2077264         8.00
       3.245     0.887500      2106889         8.89
       3.501     0.900000      2136606        10.00
       3.811     0.912500      2166409        11.43
       4.207     0.925000      2196025        13.33
       4.763     0.937500      2225685        16.00
       5.159     0.943750      2240561        17.78
       5.691     0.950000      2255269        20.00
       6.459     0.956250      2270101        22.86
       7.671     0.962500      2284968        26.67
      10.159     0.968750      2299777        32.00
      14.383     0.971875      2307198        35.56
      24.559     0.975000      2314615        40.00
      36.991     0.978125      2322033        45.71
      51.871     0.981250      2329463        53.33
      68.927     0.984375      2336876        64.00
      78.271     0.985938      2340587        71.11
      88.255     0.987500      2344301        80.00
      99.391     0.989062      2348009        91.43
     111.679     0.990625      2351727       106.67
     123.903     0.992188      2355424       128.00
     130.687     0.992969      2357285       142.22
     137.983     0.993750      2359123       160.00
     146.431     0.994531      2360992       182.86
     154.879     0.995313      2362859       213.33
     164.351     0.996094      2364700       256.00
     169.599     0.996484      2365628       284.44
     175.231     0.996875      2366555       320.00
     181.631     0.997266      2367477       365.71
     189.055     0.997656      2368406       426.67
     197.503     0.998047      2369334       512.00
     202.239     0.998242      2369800       568.89
     207.487     0.998437      2370250       640.00
     213.887     0.998633      2370721       731.43
     220.287     0.998828      2371187       853.33
     227.199     0.999023      2371643      1024.00
     231.807     0.999121      2371874      1137.78
     237.055     0.999219      2372106      1280.00
     243.199     0.999316      2372339      1462.86
     249.215     0.999414      2372570      1706.67
     254.847     0.999512      2372801      2048.00
     258.943     0.999561      2372918      2275.56
     262.911     0.999609      2373032      2560.00
     267.519     0.999658      2373150      2925.71
     272.895     0.999707      2373268      3413.33
     278.271     0.999756      2373384      4096.00
     279.807     0.999780      2373438      4551.11
     282.367     0.999805      2373500      5120.00
     284.159     0.999829      2373554      5851.43
     286.975     0.999854      2373612      6826.67
     290.815     0.999878      2373675      8192.00
     292.863     0.999890      2373702      9102.22
     295.167     0.999902      2373728     10240.00
     297.727     0.999915      2373759     11702.86
     300.543     0.999927      2373788     13653.33
     303.359     0.999939      2373815     16384.00
     305.663     0.999945      2373830     18204.44
     307.455     0.999951      2373844     20480.00
     310.527     0.999957      2373859     23405.71
     314.111     0.999963      2373876     27306.67
     317.439     0.999969      2373887     32768.00
     319.231     0.999973      2373894     36408.89
     322.047     0.999976      2373902     40960.00
     325.119     0.999979      2373910     46811.43
     330.239     0.999982      2373916     54613.33
     334.847     0.999985      2373923     65536.00
     337.663     0.999986      2373927     72817.78
     342.783     0.999988      2373932     81920.00
     347.391     0.999989      2373935     93622.86
     348.159     0.999991      2373938    109226.67
     353.279     0.999992      2373941    131072.00
     353.791     0.999993      2373943    145635.56
     355.583     0.999994      2373945    163840.00
     357.375     0.999995      2373949    187245.71
     357.375     0.999995      2373949    218453.33
     357.887     0.999996      2373950    262144.00
     360.959     0.999997      2373952    291271.11
     360.959     0.999997      2373952    327680.00
     361.471     0.999997      2373953    374491.43
     361.983     0.999998      2373955    436906.67
     361.983     0.999998      2373955    524288.00
     361.983     0.999998      2373955    582542.22
     363.775     0.999998      2373957    655360.00
     363.775     0.999999      2373957    748982.86
     363.775     0.999999      2373957    873813.33
     363.775     0.999999      2373957   1048576.00
     363.775     0.999999      2373957   1165084.44
     366.591     0.999999      2373958   1310720.00
     366.591     0.999999      2373958   1497965.71
     366.591     0.999999      2373958   1747626.67
     366.591     1.000000      2373958   2097152.00
     366.591     1.000000      2373958   2330168.89
     369.663     1.000000      2373959   2621440.00
     369.663     1.000000      2373959          inf
#[Mean    =        4.185, StdDeviation   =       18.283]
#[Max     =      369.408, Total count    =      2373959]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  3176036 requests in 40.00s, 520.97MB read
Requests/sec:  79405.09
Transfer/sec:     13.02MB